#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.ecs_task_role_policy: Reading...
data.aws_caller_identity.current_account: Reading...
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Reading...
data.aws_route53_zone.opensearch: Reading...
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Reading...
data.aws_iam_policy_document.ecs_task_role_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_execution_role_assume_role_policy: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.ecs_task_role_policy: Read complete after 0s [id=3789633034]
data.aws_acm_certificate.opensearch: Reading...
data.aws_iam_policy_document.elasticsearch-log-publishing-policy: Read complete after 0s [id=2597252832]
data.aws_caller_identity.current_account: Read complete after 0s [id=654654181948]
data.aws_route53_zone.opensearch: Read complete after 1s [id=Z0724547YPY8RPPKBNKT]
data.aws_acm_certificate.opensearch: Read complete after 1s [id=arn:aws:acm:eu-west-1:654654181948:certificate/bc14494c-2be8-47c8-9ab4-e95e40b3d41f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.get_secrets_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "get_secrets_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.write_logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "write_logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_cloudwatch_log_group.ecs_log_group will be created
  + resource "aws_cloudwatch_log_group" "ecs_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/vendedlogs/states/ecs-dev-"
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_group.opensearch_log_group_es_application_logs will be created
  + resource "aws_cloudwatch_log_group" "opensearch_log_group_es_application_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/es/dev"
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_group.opensearch_log_group_index_slow_logs will be created
  + resource "aws_cloudwatch_log_group" "opensearch_log_group_index_slow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/es/dev"
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_group.opensearch_log_group_search_slow_logs will be created
  + resource "aws_cloudwatch_log_group" "opensearch_log_group_search_slow_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = "/aws/es/dev"
      + retention_in_days = 1
      + skip_destroy      = false
      + tags_all          = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_cloudwatch_log_resource_policy.elasticsearch-log-publishing-policy will be created
  + resource "aws_cloudwatch_log_resource_policy" "elasticsearch-log-publishing-policy" {
      + id              = (known after apply)
      + policy_document = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "logs:PutLogEventsBatch",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "es.amazonaws.com"
                        }
                      + Resource  = "arn:aws:logs:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_name     = "elasticsearch-log-publishing-policy"
    }

  # aws_db_instance.dms will be created
  + resource "aws_db_instance" "dms" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "postgres_dms_dev"
      + db_subnet_group_name                  = "postgres-dms-sn-group-dev"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "16.1"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "dms-db-dev"
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + timezone                              = (known after apply)
      + username                              = "dms"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.dms will be created
  + resource "aws_db_subnet_group" "dms" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "postgres-dms-sn-group-dev"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "DB subnet group for dms database"
        }
      + tags_all                = {
          + "Name"        = "DB subnet group for dms database"
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "dms-cluster-dev"
      + tags     = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + tags_all = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.cluster will be created
  + resource "aws_ecs_cluster_capacity_providers" "cluster" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "dms-cluster-dev"
      + id                 = (known after apply)
    }

  # aws_ecs_service.backend_service will be created
  + resource "aws_ecs_service" "backend_service" {
      + cluster                            = "dms-cluster-dev"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "backend-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "backend"
          + container_port   = 8000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_service.frontend_service will be created
  + resource "aws_ecs_service" "frontend_service" {
      + cluster                            = "dms-cluster-dev"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "frontend-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "frontend"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # aws_ecs_task_definition.backend will be created
  + resource "aws_ecs_task_definition" "backend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "dms-backend-dev"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = (known after apply)
      + family                   = "dms-frontend-dev"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
    }

  # aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-execution-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task_role will be created
  + resource "aws_iam_role" "ecs_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_role_policy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "states:SendTaskSuccess"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "ecs-task-role-dev"
    }

  # aws_iam_role_policy.password_policy_secretsmanager will be created
  + resource "aws_iam_role_policy" "password_policy_secretsmanager" {
      + id          = (known after apply)
      + name        = "dms-ecs-task-secretsmanager-dev"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy.write_logs will be created
  + resource "aws_iam_role_policy" "write_logs" {
      + id          = (known after apply)
      + name        = "dms-ecs-task-write-logs-dev"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "ecs-task-execution-role-policy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-task-execution-role-dev"
    }

  # aws_iam_role_policy_attachment.task_s3_access will be created
  + resource "aws_iam_role_policy_attachment" "task_s3_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + role       = "ecs-task-role-dev"
    }

  # aws_internet_gateway.vpc will be created
  + resource "aws_internet_gateway" "vpc" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags_all = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # aws_kms_key.log_group_key will be created
  + resource "aws_kms_key" "log_group_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_kms_key_policy.log_group_key_policy will be created
  + resource "aws_kms_key_policy" "log_group_key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "log_group_key_policy_dev"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::654654181948:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.eu-west-1.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_lb.ecs_alb will be created
  + resource "aws_lb" "ecs_alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ecs-alb-dev"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "ecs-alb"
        }
      + tags_all                                                     = {
          + "Name"        = "ecs-alb"
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.ecs_alb_listener will be created
  + resource "aws_lb_listener" "ecs_alb_listener" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:eu-west-1:654654181948:certificate/bc14494c-2be8-47c8-9ab4-e95e40b3d41f"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener_rule.backend_routing will be created
  + resource "aws_lb_listener_rule" "backend_routing" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/api/*",
                ]
            }
        }
    }

  # aws_lb_target_group.ecs_bg will be created
  + resource "aws_lb_target_group" "ecs_bg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "ecs-target-group-backend-dev"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)
    }

  # aws_lb_target_group.ecs_tg will be created
  + resource "aws_lb_target_group" "ecs_tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "ecs-target-group-dev"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)
    }

  # aws_opensearch_domain.opensearch will be created
  + resource "aws_opensearch_domain" "opensearch" {
      + access_policies    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "es:*"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:es:eu-west-1:654654181948:domain/dms-engine/*"
                    },
                  + {
                      + Action    = "*"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + advanced_options   = (known after apply)
      + arn                = (known after apply)
      + dashboard_endpoint = (known after apply)
      + domain_id          = (known after apply)
      + domain_name        = "dms-engine"
      + endpoint           = (known after apply)
      + engine_version     = "OpenSearch_2.15"
      + id                 = (known after apply)
      + kibana_endpoint    = (known after apply)
      + tags_all           = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }

      + advanced_security_options {
          + anonymous_auth_enabled         = true
          + enabled                        = false
          + internal_user_database_enabled = true

          + master_user_options {
              + master_user_name     = "dms-masteruser"
              + master_user_password = (sensitive value)
            }
        }

      + cluster_config {
          + dedicated_master_enabled = false
          + instance_count           = 1
          + instance_type            = "t3.small.search"
          + zone_awareness_enabled   = false

          + zone_awareness_config {
              + availability_zone_count = 2
            }
        }

      + domain_endpoint_options {
          + custom_endpoint                 = "deltares-fairdata.com"
          + custom_endpoint_certificate_arn = "arn:aws:acm:eu-west-1:654654181948:certificate/bc14494c-2be8-47c8-9ab4-e95e40b3d41f"
          + custom_endpoint_enabled         = true
          + enforce_https                   = true
          + tls_security_policy             = "Policy-Min-TLS-1-2-2019-07"
        }

      + ebs_options {
          + ebs_enabled = true
          + iops        = (known after apply)
          + throughput  = 125
          + volume_size = 10
          + volume_type = "gp3"
        }

      + encrypt_at_rest {
          + enabled    = true
          + kms_key_id = (known after apply)
        }

      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "ES_APPLICATION_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "INDEX_SLOW_LOGS"
        }
      + log_publishing_options {
          + cloudwatch_log_group_arn = (known after apply)
          + enabled                  = true
          + log_type                 = "SEARCH_SLOW_LOGS"
        }

      + node_to_node_encryption {
          + enabled = true
        }

      + vpc_options {
          + availability_zones = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
          + vpc_id             = (known after apply)
        }
    }

  # aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_secretsmanager_secret.harbor_login will be created
  + resource "aws_secretsmanager_secret" "harbor_login" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "harbor-login-dev"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_secretsmanager_secret.postgres_credentials will be created
  + resource "aws_secretsmanager_secret" "postgres_credentials" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "dms-postgres-credentials-dev"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags_all                       = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_secretsmanager_secret_version.harbor_login will be created
  + resource "aws_secretsmanager_secret_version" "harbor_login" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.postgres_credentials will be created
  + resource "aws_secretsmanager_secret_version" "postgres_credentials" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_security_group.backend-alb will be created
  + resource "aws_security_group" "backend-alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "backend-alb-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.backend-ecs will be created
  + resource "aws_security_group" "backend-ecs" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "backend-ecs-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.dms-db will be created
  + resource "aws_security_group" "dms-db" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "Allow requests from VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow requests from dms-ecs"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "dms-db-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.dms-ecs will be created
  + resource "aws_security_group" "dms-ecs" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dms-ecs-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.frontend-alb will be created
  + resource "aws_security_group" "frontend-alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "frontend-alb-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.frontend-ecs will be created
  + resource "aws_security_group" "frontend-ecs" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "frontend-ecs-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.opensearch_security_group will be created
  + resource "aws_security_group" "opensearch_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow inbound HTTPS traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "dms-es-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.task will be created
  + resource "aws_security_group" "task" {
      + arn                    = (known after apply)
      + description            = "Security group for dms task containers, allow all outbound traffic and traffic to the EFS security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dms-task-sg-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.az1a will be created
  + resource "aws_subnet" "az1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev subnet for eu-west-1a"
        }
      + tags_all                                       = {
          + "Name"        = "dev subnet for eu-west-1a"
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.az1b will be created
  + resource "aws_subnet" "az1b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev subnet for eu-west-1b"
        }
      + tags_all                                       = {
          + "Name"        = "dev subnet for eu-west-1b"
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.az1c will be created
  + resource "aws_subnet" "az1c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "dev subnet for eu-west-1c"
        }
      + tags_all                                       = {
          + "Name"        = "dev subnet for eu-west-1c"
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "172.31.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC dev"
        }
      + tags_all                             = {
          + "Name"        = "VPC dev"
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # aws_vpc_security_group_egress_rule.allow_all_traffic_ipv4_task will be created
  + resource "aws_vpc_security_group_egress_rule" "allow_all_traffic_ipv4_task" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags_all               = {
          + "environment" = "dev"
          + "project"     = "dms"
          + "terraform"   = "true"
        }
    }

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 51 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @florislangeraert, Action: `pull_request`, Working Directory: `./infra`, Workflow: `Terraform Infrastructure Change Management Pipeline with GitHub Actions`*